{
   "name":"Assem Alhomsi Portfolio",
   "heroTitle": "Hi, I’m Assem Alhomsi.",
   "heroSubtitle": "I’m an AI engineer focused on building practical generative AI systems — from RAG pipelines and LLM orchestration to backend APIs that ship to production.",
   "showCursor":true,
   "showBlog":false,
   "darkMode":true,
   "showResume":true,
   "socials":[
      {
         "id":"1",
         "title":"Github",
         "link":"https://github.com/Assemh01"
      },
      {
         "id":"2",
         "title":"LinkedIn",
         "link":"https://www.linkedin.com/in/assem-alhomsi-bbb87b23a/"
      },
      {
         "id":"3",
         "title":"Twitter",
         "link":"https://x.com/HomsiAssem"
      },
      {
         "id":"5",
         "title":"Email",
         "link":"mailto:assem.h2001@gmail.com"
      }
   ],
   "projects": [
      {
         "id": 1,
         "title": "boxMind Academy — AI-Powered Learning Platform",
         "summary": "Built an AI-driven robotics learning platform for grades 1–12 with interactive tutoring, quizzes, and lesson-level chat assistance.",
         "impact": "Enabled self-guided learning by replacing static content with step-by-step AI tutors and adaptive quiz guidance.",
         "contributions": [
            "Designed robotics curriculum for grades 1–12 in collaboration with stakeholders and school officials",
            "Built backend infrastructure using Flask and MySQL to support lessons, quizzes, and user progress",
            "Implemented lesson-scoped RAG system allowing students to ask questions about course material",
            "Developed interactive AI tutor that guides students step-by-step instead of giving direct answers",
            "Built quiz assistant that explains mistakes and leads students to correct reasoning"
         ],
         "stack": ["Python", "Flask", "MySQL", "RAG", "LangChain", "OpenAI API", "Docker"]
      },
      {
         "id": 2,
         "title": "boxMind Flagship App — Production GenAI Platform",
         "summary": "Core GenAI platform powering multiple internal and customer-facing applications at boxMind.",
         "impact": "Improved answer quality and reliability through custom model training, automated ingestion, and systematic evaluation.",
         "contributions": [
            "Fine-tuned and trained custom LLMs alongside OpenAI, LLaMA, and Mistral APIs",
            "Designed and implemented scalable RAG architecture using Milvus vector database",
            "Automated data ingestion and embedding pipelines using Apache Airflow",
            "Added RAGAS-based evaluation to compare models, prompts, and hyperparameters",
            "Deployed full application stack to AWS with containerized services"
         ],
         "stack": ["Python", "LangChain", "Milvus", "Airflow", "RAGAS", "AWS", "Docker", "Linux"]
      },
      {
         "id": 3,
         "title": "Financial Intelligence POC — NL → SQL for SWIFT Transactions",
         "summary": "Proof-of-concept system enabling analysts to query SWIFT transaction data using natural language.",
         "impact": "Reduced manual querying complexity by allowing non-technical users to analyze financial data via chat.",
         "contributions": [
            "Built LangGraph-based agent system to translate natural language into SQL queries",
            "Performed prompt engineering to improve query correctness and reasoning steps",
            "Fine-tuned custom model for domain-specific financial terminology and schema understanding",
            "Integrated AI chatbot for transaction analysis and follow-up questions"
         ],
         "stack": ["Python", "LangGraph", "LangChain", "SQL", "LLM Fine-Tuning"]
      },
      {
         "id": 4,
         "title": "Applied AI POCs — Healthcare, Legal, and Customer Service",
         "summary": "Developed multiple GenAI proof-of-concepts across regulated and real-time domains.",
         "impact": "Demonstrated feasibility of AI assistants in healthcare, legal, and customer service environments.",
         "contributions": [
            "Built RAG system for hospital internal rules and regulations",
            "Developed legal chatbot for document and policy querying",
            "Implemented TTS/STT pipelines for stock brokers and fast-food ordering systems",
            "Handled containerization, Linux setup, and deployment for rapid prototyping",
            "Worked across backend, ML, and infrastructure roles in a startup environment"
         ],
         "stack": ["Python", "RAG", "TTS/STT", "Docker", "Linux", "OpenAI API"]
      }
      ],
   "coreSkills": [
      {
         "title": "LLM & RAG Systems",
         "description": "Production RAG pipelines, vector search, and agentic workflows for real-world AI apps.",
         "hoverText": "Milvus · LangChain · LangGraph · RAGAS · LangSmith · A100"
      },
      {
         "title": "Backend & APIs",
         "description": "Scalable backend services powering AI features, integrations, and internal tools.",
         "hoverText": "Flask · REST APIs · SQL · Docker · Linux"
      },
      {
         "title": "ML Infrastructure",
         "description": "Deploying and operating GPU-backed model serving with reliable CI/CD and monitoring.",
         "hoverText": "vLLM · Hugging Face · CI/CD · GitHub Actions · Airflow"
      },
      {
         "title": "Automation & Data Pipelines",
         "description": "Ingestion, embeddings, evaluation, and workflow automation to ship faster with quality.",
         "hoverText": "Embeddings · preprocessing · evaluation · workflow automation"
      }
   ],
   "aboutpara": "I’m an AI engineer who builds production-ready GenAI systems end-to-end — from ingestion and RAG pipelines to agentic workflows and the backend services that ship them. At boxMind.ai, I deployed LLMs on NVIDIA A100 infrastructure, built inference APIs, and improved retrieval quality through evaluation-driven iteration. I enjoy owning the full stack of an AI product: embeddings, retrieval, orchestration, and deployment. Based in Dearborn Heights, MI.",
   "resume": {
      "tagline": "AI Engineer — LLM deployment, RAG systems, and scalable backend services",
      "description": "AI Engineer specializing in LLM deployment, RAG systems, and scalable backend services. Experienced in building production-ready AI pipelines, vector search systems, and agentic workflows using GPU infrastructure and modern orchestration tools.",
      "experiences": [
         {
            "id": "boxmind",
            "dates": "July 2023 – July 2025",
            "type": "Full Time",
            "position": "Machine Learning & Generative AI Engineer — boxMind.ai",
            "bullets": [
               "Configured and deployed on-prem LLMs on NVIDIA A100 infrastructure, improving inference throughput by ~20%.",
               "Built scalable Flask-based inference services for internal and external AI access with consistent low-latency responses.",
               "Developed and maintained RAG pipelines using Milvus, LangChain, and LangGraph.",
               "Implemented evaluation workflows with RAGAS and LangSmith, improving retrieval accuracy by 15–20%.",
               "Engineered agentic LLM systems for automated content generation and workflow automation, reducing manual effort by ~30%.",
               "Created data ingestion, embedding, and text preprocessing pipelines supporting multi-document retrieval and enterprise knowledge integration.",
               "Automated deployment, testing, and monitoring using Docker, GitHub Actions, and Airflow.",
               "Designed secure, maintainable backend components using Flask, SQL, and containerized services powering production AI features."
            ]
         },
         {
            "id": "iss-intern",
            "dates": "August – September 2022",
            "type": "Internship",
            "position": "AI Development Intern — ISS (Software Hive)",
            "bullets": [
               "Built OCR pipelines using EasyOCR, PaddleOCR, and Keras.",
               "Achieved 100% license plate recognition accuracy in controlled testing scenarios.",
               "Performed model performance tuning, image preprocessing, and integration with NVR systems."
            ]
         },
         {
            "id": "handshake",
            "dates": "November 2025 – Present",
            "type": "Part Time (Remote)",
            "position": "Fellow — Handshake AI",
            "bullets": [
               "Performed data annotation and quality review tasks to support model training and evaluation.",
               "Contributed to improving dataset reliability and model performance through consistent labeling standards."
            ]
         },
         {
            "id": "w-institute",
            "dates": "December 2025 – Present",
            "type": "Part Time",
            "position": "AI, Python, & Robotics Tutor — W Institute (Livonia, MI)",
            "bullets": [
               "Taught foundational Python programming, robotics, and introductory AI concepts to students.",
               "Designed hands-on lessons and guided projects to reinforce problem-solving and computational thinking."
            ]
         }
      ],
      "education": {
         "universityName": "Beirut Arab University — Beirut, Lebanon",
         "universityDate": "Bachelor’s of Computer Engineering (2019–2023)",
         "universityPara": ""
      },
      "languages": [
         "LLM serving (A100, vLLM, Hugging Face)",
         "RAG pipelines",
         "Embeddings",
         "Vector search",
         "LangChain",
         "LangGraph",
         "OpenAI API"
      ],
      "frameworks": [
         "Flask",
         "REST APIs",
         "SQL (PostgreSQL/MySQL)",
         "Docker",
         "CI/CD",
         "Linux server administration"
      ],
      "others": [
         "Milvus",
         "Chroma",
         "Pinecone",
         "FAISS",
         "RAGAS",
         "LangSmith",
         "Airflow",
         "GitHub Actions",
         "PyTorch",
         "TensorFlow",
         "scikit-learn",
         "OpenCV",
         "EasyOCR",
         "PaddleOCR",
         "AWS (Lambda, API Gateway, S3)"
      ]
   }
}